zeha/xc32/pic32m-source/binutils/bfd/pic32-stack-usage.c
/* pic32-stack-usage.c - Contributed by Microchip Corporation.
 * Written by Alexandru Panek, Lavinia Ghica and Cosmin-Gabriel Samoila.
 */

#include "libiberty.h"
#include <limits.h>
#include <string.h>

#include "pic32-stack-usage.h"
#include "pic32-vecset.h"

bfd_boolean pic32_stack_usage = 0;

extern struct su_section *su_sections;
extern struct su_section **su_sections_arr;
extern unsigned int max_name_length;
extern unsigned int num_functions;

#define BUFFER_LEN 1024

/* we will build a string of filenames where we don't find stack
 * usage information and print it as a warning at the end
 * if stack usage is enabled
 */
static vec_type *missing_su_info_files;
static vec_type *missing_su_hdr_files;
static vec_type *files_with_wrong_version;

const char *const SU_FLAGS_REPR[SU_NUM_FLAGS] = {
  "INDIRECT_CALLS",
  "INLINE_ASM",
  "MISSING_INFO",
  "INACCURATE",
  "INTERRUPT",
  "DISJOINT_FUNC",
  "UNINTERRUPTIBLE",
  "RECURSIVE",
  "ENTRY_FUNC",
};

const char *const SU_MEMTYPE_REPR[] = {
  "STATIC",
  "DYNAMIC",
  "DYNAMIC BOUNDED"
};

uint32_t value32_to_host (const bfd * abfd, const uint32_t v)
{
  if ((__BYTE_ORDER__ == __ORDER_BIG_ENDIAN__
       && abfd->xvec->byteorder == BFD_ENDIAN_BIG)
      || (__BYTE_ORDER__ == __ORDER_LITTLE_ENDIAN__
          && abfd->xvec->byteorder == BFD_ENDIAN_LITTLE))
    return v;

  /* do the byteswap if machine endianness is different
   * from input bfd endianness.
   */
  return __builtin_bswap32 (v);
}


/* PA is enabled if '-mpa' is present in the COLLECT_GCC_OPTIONS env var */
bfd_boolean
pic32_pa_enabled (void)
{
  static int pa_enabled_value = -1;
  if (pa_enabled_value < 0)
    {
      const char *p = getenv ("COLLECT_GCC_OPTIONS");
      pa_enabled_value = p && strstr (p, "-mpa");
    }
  return pa_enabled_value;
}

extern struct su_section *
add_su_section_node (bfd * abfd,
                     const char *name,
                     uint32_t faddr, uint32_t size, uint8_t kind, uint32_t flags)
{
  struct su_section *node = su_sections, *prev;

  if (!su_sections)
    {
      su_sections = (struct su_section *) xcalloc (1, sizeof (struct su_section));
      node = su_sections;
    }
  else
    {
      while (node)
        {
          prev = node;
          node = node->next;
        }
      node = (struct su_section *) xcalloc (1, sizeof (struct su_section));
      prev->next = node;
    }

  node->fname = xstrdup (name);
  node->aliases = VEC_NEW (char *, 0, 0);
  node->the_bfd = abfd;
  node->callees = NULL;
  node->nb_callees = 0;
  node->max_callees = 0;
  node->next = NULL;

  /* Initialize this struct members only if the section is
   * not incomplete (i.e. the function has stack usage information)
   * If we don't have stack usage info for the function we should call
   * this with SU_MISSING_INFO flag set.
   */
  if (!(flags & SU_MISSING_INFO))
    {
      node->faddr = faddr;
      node->used_stack = size;
      node->used_mem_type = kind;
      node->flags = flags;
    }
  else
    node->used_stack = 0;

  /* reset SU_PROCESSED_NODE */
  node->flags &= ~SU_PROCESSED_NODE;
  /* set SU_DISJOINT_FUNC flag, unless already SU_INTERRUPT */
  if (!(node->flags & SU_INTERRUPT))
    node->flags |= SU_DISJOINT_FUNC;
  node->max_stack = UINT_MAX;

  return node;
}

/* Checks if the object has a .xc_stack_usage.hdr section
 * and the version matches with current Stack Usage version.
 *
 * A warning is thrown if the section is missing or has a different
 * version but the linking continues. This will most likely lead to
 * inaccurate stack usage computation.
 */
static void
check_su_meta_section (bfd * abfd, struct bfd_section *s)
{
  uint8_t *sec_content;
  uint32_t version;
  uint8_t size;

  if (!s)
    {
      if (!missing_su_hdr_files)
        missing_su_hdr_files = VEC_NEW (const char *, 0, 0);
      VEC_PUSHBACK (const char *, missing_su_hdr_files, xstrdup (abfd->filename));
      return;
    }

  sec_content = (uint8_t *) xmalloc (s->size);

  bfd_get_section_contents (abfd, s, sec_content, 0, s->size);

  size = sec_content[0];
  version = value32_to_host (abfd, *(uint32_t *) (sec_content + 1));

  if (version != SU_VERSION)
    {
      if (!files_with_wrong_version)
        files_with_wrong_version = VEC_NEW (const char *, 0, 0);
      VEC_PUSHBACK (const char *, files_with_wrong_version,
                    xstrdup (abfd->filename));
    }
}

/* Returns first node with this function name or NULL.
 * Obs: There might be multiple nodes with the same function
 *      names that can come from different objects;
 *      abfd == NULL will return the first node with a matching name,
 *      abfd != NULL will match on both name and bfd
 */
extern struct su_section *
get_function_by_name_bfd (const char *fname, bfd * abfd)
{
  struct su_section *node = su_sections;
  int i;

  while (node)
    {
      if (!abfd || (abfd == node->the_bfd))
        {
          if (!strcmp (node->fname, fname))
            return node;

          /* also check the aliases / alternate names */
          for (i = 0; i != VEC_SIZE (node->aliases); ++i)
            if (!strcmp (fname, VEC (char *, node->aliases, i)))
              return node;
        }
      node = node->next;
    }

  return NULL;
}

/* Generic iterator over the sections; calls 'func' for each su_section,
 * passing it the su_section address and 'param'.
 * If the callback returns a non-zero value, the iteration stops and
 * 'map_over_su_sections' returns with that value,
 * otherwise it returns zero (i.e. all sections were processed ok). */
extern intptr_t
map_over_su_sections (intptr_t (*func) (struct su_section *, void *), void *param)
{
  intptr_t rc = 0;
  if (func)
    {
      struct su_section *node = su_sections;

      while (node && (rc = func (node, param)) == 0)
        node = node->next;
    }
  return rc;
}

#define FST_NB_CALLEES	2
#ifndef NEXTPOW2
#define NEXTPOW2(X) ({ \
  uint32_t x = (X); x ? 1U << (32 - __builtin_clz (x)) : 1U; })
#endif


void
add_func_callee (struct su_section *const node, struct su_section *const callee_node)
{
  /* first callee added */
  if (node->callees == NULL)
    {
      node->callees = (struct su_section **) xcalloc (FST_NB_CALLEES,
                                                      sizeof (struct su_section *));
      node->max_callees = FST_NB_CALLEES;
      node->nb_callees = 1;
      node->callees[0] = callee_node;
    }
  else
    {
      /* avoid adding a callee multiple times */
      uint32_t i;
      for (i = 0; i != node->nb_callees; ++i)
        if (callee_node == node->callees[i])
          return;

