zeha/xc32/pic32m-source/binutils/bfd/pic32-stack-usage.c
      if (node->nb_callees == node->max_callees)
        {
          node->max_callees = NEXTPOW2 (node->max_callees);
          node->callees = xrealloc (node->callees,
                                    node->max_callees *
                                    sizeof (struct su_section *));
        }
      node->callees[node->nb_callees++] = callee_node;
    }

  /* callee is no longer a disjoint function */
  callee_node->flags &= ~SU_DISJOINT_FUNC;
}


/* Returns first node that is not processed
 * (i.e. SU_PROCESSED_NODE flag unset)
 */
extern struct su_section *
get_first_unprocessed_su_section ()
{
  struct su_section *node = su_sections;

  while (node)
    {
      node = node->next;
      if (!(node->flags & SU_PROCESSED_NODE))
        return node;
    }

  return NULL;
}


/* Returns the ELF symbol for a su_section (corresponding to its 'fname') */
static Elf_Internal_Sym *
get_node_sym (struct su_section   *node,
              Elf_Internal_Sym    *isymbuf)
{
  Elf_Internal_Shdr *symtab_hdr = &elf_symtab_hdr (node->the_bfd);
  size_t symcount = symtab_hdr->sh_size / sizeof (Elf32_External_Sym);
  Elf_Internal_Sym *isym, *isymend;

  for (isym = isymbuf + 1, isymend = isymbuf + symcount; isym < isymend; ++isym)
    if ((ELF_ST_TYPE (isym->st_info) == STT_FUNC
          || ELF_ST_TYPE (isym->st_info) == STT_OBJECT) /* XC32-1689: STT_OBJECTs also */
        && !strcmp (node->fname, bfd_elf_sym_name (node->the_bfd, symtab_hdr,
                                                   isym, NULL)))
      return isym;

  return NULL;
}


/* a su_section and the corresponsing ELF symbol */
typedef struct su_section_sym {
  struct su_section *node;
  Elf_Internal_Sym  *isym;
} su_section_sym;


/* fills in the aliases information for all the su_sections in the specified bfd */
static void
fill_aliases_info (bfd              *abfd,
                   Elf_Internal_Sym *isymbuf,
                   vec_type         *su_syms)
{
  Elf_Internal_Shdr *symtab_hdr = &elf_symtab_hdr (abfd);
  size_t symcount = symtab_hdr->sh_size / sizeof (Elf32_External_Sym);
  Elf_Internal_Sym *isym, *isymend, *isym2;
  int i;

  /* for each function symbol */
  for (isym = isymbuf + 1, isymend = isymbuf + symcount; isym < isymend; ++isym)
    if (ELF_ST_TYPE (isym->st_info) == STT_FUNC)
      {
        /* see if it's an alias to an existing su_section */
        for (i = 0; i != VEC_SIZE (su_syms); ++i)
          {
            su_section_sym *su_sym = &VEC (su_section_sym, su_syms, i);
            isym2 = su_sym->isym;

            /* i.e. a different function symbol but with the same address */
            if (isym2 != isym
                && isym2->st_shndx == isym->st_shndx
                && isym2->st_value == isym->st_value)
              {
                const char *name = bfd_elf_sym_name (abfd, symtab_hdr, isym, NULL);
                /* ok, add it to the list of aliases for this su_section */
                VEC_PUSHBACK (char *, su_sym->node->aliases, xstrdup (name));
              }
          }
      }
}

static bfd_boolean
pic32_is_PAed_object (bfd *abfd)
{
  static const char pa_obj_prefix[] = "__pa_outline_";
  return pic32_pa_enabled ()
           && !strncmp (basename (abfd->filename),
                        pa_obj_prefix, sizeof (pa_obj_prefix) - 1);
}

/* This function is called for each object to parse the
 * concatenated .xc_stack_usage* sections.
 *
 * A warning is thrown if any of the stack usage sections are missing
 * or if object has a different stack usage version. The linking continues
 * but this will most likely lead to inaccurate stack usage computation.
 */
extern void
add_su_sections_from_bfd (bfd * abfd)
{
  Elf_Internal_Shdr *symtab_hdr = &elf_symtab_hdr (abfd);
  Elf_Internal_Sym *isymbuf = NULL;
  struct bfd_section *bfd_sec = abfd->sections;
  struct bfd_section *sec = NULL, *meta_sec = NULL;
  uint8_t *sec_content;
  bfd_size_type sec_size;
  int offset = 0;
  int i = 0;
  int fname_sz;
  vec_type *su_syms = NULL;

  /* XC32-1683: ignore the objects created by the PA tool as we know those
   * are not containing any SU info at the moment and we compensate for that
   * by detecting the PAed callees in pic32_su_max_stack () */
  if (pic32_is_PAed_object (abfd))
    return;

  for (; bfd_sec; bfd_sec = bfd_sec->next)
    {
      if (CONST_STRNEQ (bfd_sec->name, SU_SECTION_HDR))
        {
          meta_sec = bfd_sec;
        }
      else if (CONST_STRNEQ (bfd_sec->name, SU_SECTION))
        {
          sec = bfd_sec;
        }
    }

  /* first check the header and extract version */
  check_su_meta_section (abfd, meta_sec);

  /* we will only be adding the .xc_stack_usage sections */
  if (!sec)
    {
      if (!missing_su_info_files)
        missing_su_info_files = VEC_NEW (const char *, 0, 0);
      VEC_PUSHBACK (const char *, missing_su_info_files, xstrdup (abfd->filename));
      return;
    }

  sec_size = sec->size;

  sec_content = (uint8_t *) xmalloc (sec_size);

  /* get the section contents for parsing */
  bfd_get_section_contents (abfd, sec, sec_content, 0, sec_size);

  /* also get the bfd symbols for filling out the alias info */
  isymbuf =
    bfd_elf_get_elf_syms (abfd, symtab_hdr,
                          symtab_hdr->sh_size / sizeof (Elf32_External_Sym),
                          0, NULL, NULL, NULL);

  su_syms = VEC_NEW (su_section_sym, 0, 0);
  while (offset < sec_size)
    {
      su_section_sym su_sym;
      uint32_t faddr = value32_to_host (abfd, *(uint32_t *) (sec_content + offset));
      offset += 4;
      char *fname = (char *) (sec_content + offset);
      fname_sz = strlen (fname);
      offset += (fname_sz + 1);
      uint32_t size = value32_to_host (abfd, *(uint32_t *) (sec_content + offset));
      offset += 4;
      uint32_t flags = value32_to_host (abfd, *(uint32_t *) (sec_content + offset));
      offset += 4;
      uint8_t kind = sec_content[offset];
      offset++;

      /* add a su_section node in the linked list */
      su_sym.node = add_su_section_node (abfd, fname, faddr, size, kind, flags);

      /* (temporarily) collect the SU infos from this bfd + the assoc. syms */
      su_sym.isym = get_node_sym (su_sym.node, isymbuf);
      if (su_sym.isym)
        VEC_PUSHBACK (su_section_sym, su_syms, su_sym);
      else
        fprintf (stderr, "warning: symbol for '%s' su_section not found (%s)\n",
                 fname, abfd->filename); /* XC32-1689: warn about missing symbols */
    }

  if (offset != sec_size)
    {
      fprintf (stderr,
               "error: something went wrong when parsing stack usage sections: parsed_bytes != sec_size\n");
      abort ();
    }

  fill_aliases_info (abfd, isymbuf, su_syms);
  VEC_DELETE (su_syms);

  free (sec_content);
  free (isymbuf);
}

/* This counts the number of su_section nodes and stores all the pointers
 * in an array. It assumes that linked list will remain unchanged after
 * this function was called and we will use the index in the array as an
 * unique ID for a section. This ID will be used in the algoritm for
 * computing maximum used stack.
 *
 * While itterating through list, we will also gather the maximum
 * function name length for pretty printing.
 */
extern void
su_allocate_array ()
{
  struct su_section *node = su_sections;
  unsigned int nlen, i = 0;
  num_functions = 0;
  max_name_length = 0;

