zeha/xc32/pic32m-source/binutils/bfd/pic32-stack-usage.c
  while (node)
    {
      num_functions++;
      nlen = strlen (node->fname);
      if (nlen > max_name_length)
        max_name_length = nlen;
      node = node->next;
    }

  /* put a max length for formating to 20 characters */
  if (max_name_length > 20)
    max_name_length = 20;

  su_sections_arr =
    (struct su_section **) xmalloc (num_functions * sizeof (struct su_section *));

  node = su_sections;
  while (node)
    {
      su_sections_arr[i] = node;
      node = node->next;
      i++;
    }
}

/* helper to get the su_section for a certain function;
 * if a real su_section isn't found for the function, a dummy one is created  */
struct su_section *
pic32_su_call_graph_get_create (bfd * abfd, const char *fname, bfd_vma faddr)
{
  struct su_section *node = get_function_by_name_bfd (fname, abfd);

  if (node == NULL)
    {
      /* add new node in su_sections */
      node = add_su_section_node (abfd, fname, faddr , 0, 0,
                                  SU_MISSING_INFO);
    }
  else if (node->faddr == 0)
    node->faddr = faddr;

  return node;
}

/* helper to add an arc in the call graph given the two functions/nodes */
void
pic32_su_add_to_call_graph (bfd * caller_bfd, const char *caller_name, bfd_vma caller_addr,
                            bfd * callee_bfd, const char *callee_name, bfd_vma callee_addr)
{
  struct su_section *caller_node =
    pic32_su_call_graph_get_create (caller_bfd, caller_name, caller_addr);

  struct su_section *callee_node =
    pic32_su_call_graph_get_create (callee_bfd, callee_name, callee_addr);

  add_func_callee (caller_node, callee_node);
}


extern void
free_su_sections ()
{
  struct su_section *next, *node = su_sections;
  int i;

  while (node)
    {
      next = node->next;
      free (node->fname);

      for (i = 0; i != VEC_SIZE (node->aliases); ++i)
        free (VEC (char *, node->aliases, i));
      VEC_DELETE (node->aliases);

      if (node->callees != NULL)
        free (node->callees);

      free (node);
      node = next;
    }
  su_sections = NULL;

  free (su_sections_arr);
  su_sections_arr = NULL;
}

extern void
print_su_sections ()
{
  struct su_section *node = su_sections;
  int i;

  while (node)
    {
      printf ("Stack Usage: function %s @%X used stack 0x%x, type: %s",
              node->fname, node->faddr, node->used_stack,
              SU_MEMTYPE_REPR[node->used_mem_type]);
      if (node->the_bfd)
        printf (", filename: %s, flags: {", node->the_bfd->filename);
      else
        printf (", (nil), flags {");
      for (i = 0; i < SU_NUM_FLAGS; i++)
        {
          if (node->flags & (1 << i))
            {
              printf ("%s,", SU_FLAGS_REPR[i]);
            }
        }
      if (node->flags & SU_INTERRUPT)
        printf ("}, IPL: %u;\n", SU_GET_IPL (node->flags));
      else
        printf ("};\n");
      if (VEC_SIZE (node->aliases))
        {
          printf ("\taliases:");
          for (i = 0; i != VEC_SIZE (node->aliases); ++i)
            printf (" %s", VEC (char *, node->aliases, i));
          printf ("\n");
        }
      node = node->next;
    }
}

static inline void
su_print_report_lines (FILE * fp, uint32_t flag)
{
  char line_buffer[BUFFER_LEN];
  int offset = 0;
  struct su_section *node;

  for (node = su_sections; node != NULL; node = node->next)
    {
      uint32_t flags = node->flags;
      if (flags & SU_DISCARDED_NODE) /* ignore discarded functions */
        continue;
      if (flags & flag)
        {
          offset = snprintf (line_buffer, BUFFER_LEN - 1, "\n\t%s", node->fname);

          /* we don't give an estimate for recursive functions */
          if (flag != SU_RECURSIVE)
            offset +=
              snprintf (line_buffer + offset, BUFFER_LEN - 1 - offset,
                        " uses %d bytes", node->max_stack);

          /* if we are printing in file, also print address */
          if (fp != stdout)
            offset +=
              snprintf (line_buffer + offset, BUFFER_LEN - 1 - offset,
                        " (address 0x%X)", node->faddr);

          fprintf (fp, "%s", line_buffer);
        }
    }
}


static inline int
su_file_reached (vec_type * v, unsigned int idx)
{
  const char *v_val = VEC (const char *, v, idx);
  struct su_section *node;

  for (node = su_sections; node != NULL; node = node->next)
    if (node->the_bfd && strcmp (node->the_bfd->filename, v_val) == 0)
      return 1;
  return 0;
}


/* When we print the report for stack usage we might issue
 * error/warning messages when we don't find SU info in .o files:
 * warning: .xc_stack_usage section is missing from files:
 *    linker stubs
 *    /opt/microchip/xc32/v3.00/bin/bin/../../lib/gcc/pic32c/8.3.1/thumb/v7e-m+fp/hard/crti.o
 *    /opt/microchip/xc32/v3.00/bin/bin/../../lib/gcc/pic32c/8.3.1/thumb/v7e-m+fp/hard/crtbegin.o
 *    data_init.o
 *    lib_a-init.o
 *    /opt/microchip/xc32/v3.00/bin/bin/../../lib/gcc/pic32c/8.3.1/thumb/v7e-m+fp/hard/crtend.o
 *    /opt/microchip/xc32/v3.00/bin/bin/../../lib/gcc/pic32c/8.3.1/thumb/v7e-m+fp/hard/crtn.o
 *
 * One of the problems is that those .o might not have any function inside
 * or will not be reached. In this function, we will eliminate all the .o
 * files reported here but not reached when building the call graph.
 */
static void
su_eliminate_unreached_files ()
{
  struct su_section *node;
  unsigned int i;

  if (missing_su_info_files)
    {
      for (i = 0; i != VEC_SIZE (missing_su_info_files); i++)
        {
          if (!su_file_reached (missing_su_info_files, i))
            {
              char *str = VEC (char *, missing_su_info_files, i);
              free (str);
              VEC_ERASE (char *, missing_su_info_files, i);
              i--;
            }
        }
    }

  if (missing_su_hdr_files)
    {
      for (i = 0; i != VEC_SIZE (missing_su_hdr_files); i++)
        {
          if (!su_file_reached (missing_su_hdr_files, i))
            {
              char *str = VEC (char *, missing_su_hdr_files, i);
              free (str);
              VEC_ERASE (char *, missing_su_hdr_files, i);
              i--;
            }
        }
    }

