zeha/xc32/pic32m-source/binutils/bfd/pic32-stack-usage.c
  if (files_with_wrong_version)
    {
      for (i = 0; i != VEC_SIZE (files_with_wrong_version); i++)
        {
          if (!su_file_reached (files_with_wrong_version, i))
            {
              char *str = VEC (char *, files_with_wrong_version, i);
              free (str);
              VEC_ERASE (char *, files_with_wrong_version, i);
              i--;
            }
        }
    }
}

/*
 * Stack Usage Estimation
 * function that prints the stack usage report
 */
extern void
pic32_print_su_report (FILE * fp)
{
  struct su_section *root = NULL, *node;
  /* if we have to print a line > 512 chars in the report,
   * something is definetly wrong.
   */
  unsigned int recursive_funcs = 0;
  unsigned int inaccurate_funcs = 0;
  unsigned int interrupt_funcs = 0;
  unsigned int disjoint_funcs = 0;
  int index = 1;
  int offset = 0;

  /* it is not necessary to count how many functions we have
   * for each category but since we most likely will anyway
   * iterate through all sections anyway, we could count them
   * and use this information to pretty format if necessary
   */
  for (node = su_sections; node != NULL; node = node->next)
    {
      uint32_t flags = node->flags;
      if (flags & SU_DISCARDED_NODE) /* ignore discarded functions */
        continue;
      if (flags & SU_RECURSIVE)
        recursive_funcs++;
      if (flags & SU_INACCURATE)
        inaccurate_funcs++;
      if (flags & SU_INTERRUPT)
        interrupt_funcs++;
      if (flags & SU_DISJOINT_FUNC)
        disjoint_funcs++;
      if (!root && (flags & SU_ENTRY_FUNC))
        root = node;
    }

  fprintf (fp, "============= STACK USAGE GUIDANCE =============\n");

  /* do this print only when printing the report not when dumping it
   * into the mapfile
   */
  if (fp == stdout)
    {
      unsigned i;

      su_eliminate_unreached_files ();

      if (missing_su_info_files && VEC_SIZE (missing_su_info_files))
        {
          fprintf (stderr,
                   "warning: .xc_stack_usage section is missing from %d files:\n",
                   VEC_SIZE (missing_su_info_files));
          for (i = 0; i != VEC_SIZE (missing_su_info_files); ++i)
            fprintf (stderr, "\t%s\n", VEC (const char *, missing_su_info_files, i));
          fprintf (stderr,
                   "Stack Usage analysis might be inaccurate because of this.\n");
          VEC_DELETE (missing_su_info_files);
        }

      if (missing_su_hdr_files && VEC_SIZE (missing_su_hdr_files))
        {
          fprintf (stderr,
                   "warning: .xc_stack_usage.hdr section is missing from %d files:\n",
                   VEC_SIZE (missing_su_hdr_files));
          for (i = 0; i != VEC_SIZE (missing_su_hdr_files); ++i)
            fprintf (stderr, "\t%s\n", VEC (const char *, missing_su_hdr_files, i));
          fprintf (stderr,
                   "Stack Usage analysis might be inaccurate because of this.\n");
          VEC_DELETE (missing_su_hdr_files);
        }

      if (files_with_wrong_version && VEC_SIZE (files_with_wrong_version))
        {
          fprintf (stderr,
                   "warning: Different stack usage version for %d files:\n",
                   VEC_SIZE (files_with_wrong_version));
          for (i = 0; i != VEC_SIZE (files_with_wrong_version); ++i)
            fprintf (stderr, "\t%s\n",
                     VEC (const char *, files_with_wrong_version, i));
          fprintf (stderr,
                   "Stack Usage analysis might be inaccurate because of this.\n");
          VEC_DELETE (files_with_wrong_version);
        }
    }

  if (root)
    {
      fprintf (fp, "In the call graph beginning at %s", root->fname);
      /* if we are printing in file, also print address */
      if (fp != stdout)
        fprintf (fp, " (address 0x%X)", root->faddr);
      fprintf (fp, ",\n\t%d bytes of stack are required.\n", root->max_stack);
    }
  else
    {
      fprintf (fp, "Couldn't determine the root of the main call graph.\n");
    }

  if (recursive_funcs || inaccurate_funcs || interrupt_funcs || disjoint_funcs)
    fprintf (fp, "\nHowever, the following cautions exists:\n");

  /* print recursive functions */
  if (recursive_funcs)
    {
      fprintf (fp, "\n%d. Recursion has been detected:", index);
      su_print_report_lines (fp, SU_RECURSIVE);
      fprintf (fp, "\nNo stack usage predictions can be made.\n");
      index++;
    }

  /* print inaccurate functions */
  if (inaccurate_funcs)
    {
      fprintf (fp, "\n%d. Indeterminate stack adjustment has been detected:", index);
      su_print_report_lines (fp, SU_INACCURATE);
      fprintf (fp, "\nNo stack usage predictions can be made.\n");
      index++;
    }

  /* print interrupt functions */
  if (interrupt_funcs)
    {
      fprintf (fp, "\n%d. The following functions are interrupt functions:", index);
      su_print_report_lines (fp, SU_INTERRUPT);
      fprintf (fp, "\nYou must add stack allowances for those functions.\n");
      index++;
    }

  /* print disjoint functions */
  if (disjoint_funcs)
    {
      fprintf (fp,
               "\n%d. The following functions cannot be connected to the main call graph.\n",
               index);
      fprintf (fp, "This is usually caused by some indirection:");
      su_print_report_lines (fp, SU_DISJOINT_FUNC);
      fprintf (fp, "\nYou must add stack allowances for those functions.\n");
      index++;
    }

  fprintf (fp, "================================================\n");
}
